Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/btzbsys.h
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_sel_top Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_sel_top Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_top_Pos)) /* Assigment of value for subsys_dbg_bus_sel_top in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Pos _UINT32_(2)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_dbg_bus_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_dbg_bus_sel_Pos)) /* Assigment of value for subsys_dbg_bus_sel in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Pos _UINT32_(4)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_clk_src_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_clk_src_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_clk_src_sel_Pos)) /* Assigment of value for subsys_clk_src_sel in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Pos _UINT32_(6)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_clk_div_sel Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_clk_div_sel Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel(value) (BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_ssubsys_clk_div_sel_Pos)) /* Assigment of value for ssubsys_clk_div_sel in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_xtal_ready_Pos _UINT32_(8)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_bypass_xtal_ready Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_xtal_ready_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_xtal_ready_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_bypass_xtal_ready Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_xtal_ready(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_xtal_ready_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_xtal_ready_Pos)) /* Assigment of value for subsys_bypass_xtal_ready in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_pll_lock_Pos _UINT32_(9)                                          /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_bypass_pll_lock Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_pll_lock_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_pll_lock_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_bypass_pll_lock Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_pll_lock(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_pll_lock_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_bypass_pll_lock_Pos)) /* Assigment of value for subsys_bypass_pll_lock in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Pos _UINT32_(12)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_xtal_ready_delay Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Msk (_UINT32_(0xF) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) subsys_xtal_ready_delay Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay(value) (BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_subsys_xtal_ready_delay_Pos)) /* Assigment of value for subsys_xtal_ready_delay in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Pos _UINT32_(16)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) tr_sw_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) tr_sw_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_iom_en_Pos)) /* Assigment of value for tr_sw_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Pos _UINT32_(17)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) tr_sw_n_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) tr_sw_n_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_tr_sw_n_iom_en_Pos)) /* Assigment of value for tr_sw_n_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Pos _UINT32_(18)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) pa_on_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) pa_on_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_pa_on_iom_en_Pos)) /* Assigment of value for pa_on_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Pos _UINT32_(19)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) lna_on_iom_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) lna_on_iom_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_lna_on_iom_en_Pos)) /* Assigment of value for lna_on_iom_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Pos _UINT32_(20)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) zb_bt_bar_ovrd_en Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) zb_bt_bar_ovrd_en Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en(value) (BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_en_Pos)) /* Assigment of value for zb_bt_bar_ovrd_en in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Pos _UINT32_(21)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) zb_bt_bar_ovrd_val Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) zb_bt_bar_ovrd_val Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val(value) (BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_zb_bt_bar_ovrd_val_Pos)) /* Assigment of value for zb_bt_bar_ovrd_val in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Pos _UINT32_(22)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) invert_btadc_clk Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) invert_btadc_clk Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk(value) (BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_invert_btadc_clk_Pos)) /* Assigment of value for invert_btadc_clk in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Pos _UINT32_(23)                                         /* (BTZBSYS_SUBSYS_CNTRL_REG1) clk_lp_req Position */
#define BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Pos) /* (BTZBSYS_SUBSYS_CNTRL_REG1) clk_lp_req Mask */
#define BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req(value) (BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_CNTRL_REG1_clk_lp_req_Pos)) /* Assigment of value for clk_lp_req in the BTZBSYS_SUBSYS_CNTRL_REG1 register */
#define BTZBSYS_SUBSYS_CNTRL_REG1_Msk         _UINT32_(0x00FFF3FF)                                 /* (BTZBSYS_SUBSYS_CNTRL_REG1) Register Mask  */


/* -------- BTZBSYS_SUBSYS_STATUS_REG0 : (BTZBSYS Offset: 0x20) (R/W 32) SUBSYS_STATUS_REG0 -------- */
#define BTZBSYS_SUBSYS_STATUS_REG0_RESETVALUE _UINT32_(0x00)                                       /*  (BTZBSYS_SUBSYS_STATUS_REG0) SUBSYS_STATUS_REG0  Reset Value */

#define BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_STATUS_REG0) zb_sleep_mode Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) zb_sleep_mode Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode(value) (BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Pos)) /* Assigment of value for zb_sleep_mode in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Pos _UINT32_(1)                                          /* (BTZBSYS_SUBSYS_STATUS_REG0) zb_deep_sleep_mode Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) zb_deep_sleep_mode Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode(value) (BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Pos)) /* Assigment of value for zb_deep_sleep_mode in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Pos _UINT32_(2)                                          /* (BTZBSYS_SUBSYS_STATUS_REG0) radio_idle_zb Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) radio_idle_zb Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb(value) (BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Pos)) /* Assigment of value for radio_idle_zb in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Pos _UINT32_(16)                                         /* (BTZBSYS_SUBSYS_STATUS_REG0) bt_low_power_mode Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) bt_low_power_mode Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode(value) (BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Pos)) /* Assigment of value for bt_low_power_mode in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Pos _UINT32_(17)                                         /* (BTZBSYS_SUBSYS_STATUS_REG0) bt_rf_idle Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) bt_rf_idle Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle(value) (BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Pos)) /* Assigment of value for bt_rf_idle in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_Msk        _UINT32_(0x00030007)                                 /* (BTZBSYS_SUBSYS_STATUS_REG0) Register Mask  */


